practice-for-ch-rails-music-app-long-practice-main/practice-for-ch-rails-music-app-long-practice-main/Music_App/app/models/user.rb

  def reset_session_token!
    self.session_token = generate_unique_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-08-08 20:01:17.103963"], ["id", 1]]

  def generate_unique_session_token
    loop do
    session_token = SecureRandom::urlsafe_base64
      return session_token unless User.exists?(session_token: session_token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]